src/cf/Enums/ВидыНалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыНалогов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Госпошлина_ГосрегистрацияОрганизаций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныеВзносы_ПФР_ВредныеУсловия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныеВзносы_ПФР_ЛетныеЭкипажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныеВзносы_ПФР_ТяжелыеУсловия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныеВзносы_ПФР_Шахтеры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕНВД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕСХН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗемельныйНалог_ВнутригородскойОкруг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗемельныйНалог_ГородскоеПоселение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗемельныйНалог_ГородскойОкруг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗемельныйНалог_ГородскойОкругСВнутригородскимДелением</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗемельныйНалог_ГородФедеральногоЗначения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗемельныйНалог_МежселеннаяТерритория</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗемельныйНалог_СельскоеПоселение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗемельныйНалог_МуниципальныйОкруг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаИмущество</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаИмуществоЕСГС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаПрибыль_НалоговыйАгент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаПрибыль_РегиональныйБюджет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаПрибыль_ФедеральныйБюджет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаПрофессиональныйДоход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС_ВвозимыеТовары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛ_ДоходыСвышеПредельнойВеличины</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛ_ИП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛ_ИП_НалоговаяБазаСвышеПредельнойВеличины</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛ_ФизЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеНалогиИСборы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПСН_ВнутригородскойРайон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПСН_ГородскойОкруг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПСН_ГородскойОкругСВнутригородскимДелением</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПСН_ГородФедеральногоЗначения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПСН_МуниципальныйРайон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПСН_МуниципальныйОкруг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы_ПФР_Добровольные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы_ПФР_НакопительнаяЧасть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы_ПФР_СтраховаяЧасть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы_ФСС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы_ФСС_НСиПЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы_ФФОМС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТорговыйСбор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТранспортныйНалог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УСН_Доходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УСН_ДоходыМинусРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УСН_МинимальныйНалог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныеВзносы_ПФР_НакопительнаяЧасть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныеВзносы_ПФР_СтраховаяЧасть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныеВзносы_ФСС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныеВзносы_ФФОМС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АУСН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕдиныйНалоговыйПлатеж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныеВзносы_ПФР_Добровольные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносыЕдиныйТариф</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныеВзносы_СтраховыеВзносыЕдиныйТариф</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныеВзносы_СвышеПредела</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛ_Дивиденды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛ_Дивиденды_ДоходыСвышеПредельнойВеличины</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы_ОПС_ИностранныеРаботники</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы_ОМС_ИностранныеРаботники</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы_ОСС_ИностранныеРаботники</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТуристическийНалог</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/ЕдиныйНалоговыйСчетПовтИсп/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция НалогиУплачиваемыеОтдельно() Экспорт
	
	МассивНалогов = Новый Массив;
	
	ВидыНалогов = ВидыНалоговУплачиваемыеОтдельно();
	Для Каждого ВидНалога Из ВидыНалогов Цикл
		Налог = Справочники.ВидыНалогов.НалогПоВиду(ВидНалога);
		Если ЗначениеЗаполнено(Налог) Тогда
			МассивНалогов.Добавить(Налог);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивНалогов
	
КонецФункции

Функция ВидыНалоговУплачиваемыеОтдельно() Экспорт
	
	МассивВидовНалогов = Новый Массив;
	МассивВидовНалогов.Добавить(Перечисления.ВидыНалогов.ЕдиныйНалоговыйПлатеж);
	МассивВидовНалогов.Добавить(Перечисления.ВидыНалогов.СтраховыеВзносы_ФСС_НСиПЗ);
	МассивВидовНалогов.Добавить(Перечисления.ВидыНалогов.ФиксированныеВзносы_ФСС);
	
	Возврат МассивВидовНалогов
	
КонецФункции

Функция МассивДоступныхВидовНалогов() Экспорт
	
	МассивВидовНалогов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Перечисления.ВидыНалогов.ПустаяСсылка());
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивВидовНалогов, ВидыНалоговУплачиваемыеОтдельно());
	
	Возврат МассивВидовНалогов
	
КонецФункции

Функция ВидыАгентскогоНДФЛ() Экспорт
	
	МассивВидовНалогов = Новый Массив;
	// НДФЛ
	МассивВидовНалогов.Добавить(Перечисления.ВидыНалогов.НДФЛ);
	МассивВидовНалогов.Добавить(Перечисления.ВидыНалогов.НДФЛ_ДоходыСвышеПредельнойВеличины);
	
	Возврат МассивВидовНалогов;
	
КонецФункции

Функция ВидыСтраховыхВзносов() Экспорт
	
	МассивВидовНалогов = Новый Массив;
	
	// ПФР - кроме добровольных
	МассивВидовНалогов.Добавить(Перечисления.ВидыНалогов.СтраховыеВзносы_ПФР_НакопительнаяЧасть);
	МассивВидовНалогов.Добавить(Перечисления.ВидыНалогов.СтраховыеВзносы_ПФР_СтраховаяЧасть);
	МассивВидовНалогов.Добавить(Перечисления.ВидыНалогов.ФиксированныеВзносы_ПФР_НакопительнаяЧасть);
	МассивВидовНалогов.Добавить(Перечисления.ВидыНалогов.ФиксированныеВзносы_ПФР_СтраховаяЧасть);
	
	// ФСС - кроме НС и ПЗ и фиксированных взносов
	МассивВидовНалогов.Добавить(Перечисления.ВидыНалогов.СтраховыеВзносы_ФСС);
	
	// ФФОМС
	МассивВидовНалогов.Добавить(Перечисления.ВидыНалогов.СтраховыеВзносы_ФФОМС);
	МассивВидовНалогов.Добавить(Перечисления.ВидыНалогов.ФиксированныеВзносы_ФФОМС);
	
	// Единый тариф
	МассивВидовНалогов.Добавить(Перечисления.ВидыНалогов.СтраховыеВзносыЕдиныйТариф);
	МассивВидовНалогов.Добавить(Перечисления.ВидыНалогов.ФиксированныеВзносы_СтраховыеВзносыЕдиныйТариф);
	МассивВидовНалогов.Добавить(Перечисления.ВидыНалогов.ФиксированныеВзносы_СвышеПредела);
	
	Возврат МассивВидовНалогов;
	
КонецФункции

Функция НалогиУплачиваемыеЕжемесячно() Экспорт
	
	МассивВидовНалогов = Новый Массив;
	
	// Страховые взносы
	МассивВидовНалогов.Добавить(Перечисления.ВидыНалогов.СтраховыеВзносы_ПФР_НакопительнаяЧасть);
	МассивВидовНалогов.Добавить(Перечисления.ВидыНалогов.СтраховыеВзносы_ПФР_СтраховаяЧасть);
	МассивВидовНалогов.Добавить(Перечисления.ВидыНалогов.СтраховыеВзносы_ФФОМС);
	МассивВидовНалогов.Добавить(Перечисления.ВидыНалогов.СтраховыеВзносыЕдиныйТариф);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивВидовНалогов, ВидыАгентскогоНДФЛ());
	
	Возврат МассивВидовНалогов;
	
КонецФункции

Функция ВсеВидыНалоговНДФЛ() Экспорт
	
	МассивВидовНалогов = Новый Массив;
	
	// Дополним НДФЛ агента
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивВидовНалогов, ВидыНалоговНДФЛНалоговогоАгента());
	
	// Вернем весь НДФЛ
	Возврат Новый ФиксированныйМассив(МассивВидовНалогов);
	
КонецФункции

Функция ВидыНалоговНДФЛНалоговогоАгента() Экспорт
	
	МассивВидовНалогов = Новый Массив;
	
	// НДФЛ налогового агента
	ВидыАгентскогоНДФЛ = ВидыАгентскогоНДФЛ();
	Для Каждого ВидНалога Из ВидыАгентскогоНДФЛ Цикл
		МассивВидовНалогов.Добавить(Справочники.ВидыНалогов.НалогПоВиду(ВидНалога));
	КонецЦикла;
	
	Возврат Новый ФиксированныйМассив(МассивВидовНалогов);
	
КонецФункции

Функция ВидыНалоговСтраховыеВзносы() Экспорт
	
	МассивВидовНалогов = Новый Массив;
	
	ВидыСтраховыхВзносов = ВидыСтраховыхВзносов();
	Для Каждого ВидНалога Из ВидыСтраховыхВзносов Цикл
		ВидНалогаПлатежа = Справочники.ВидыНалогов.НалогПоВиду(ВидНалога, Ложь);		
	
		МассивВидовНалогов.Добавить(ВидНалогаПлатежа);
	КонецЦикла;
	
	Возврат Новый ФиксированныйМассив(МассивВидовНалогов);
	
КонецФункции

#КонецОбласти
